Revit 2027 API
IFCFileReadOptions.XMLConfigFileName Property
 The XML configuration file name. It is used only for reading IFC-XML format file.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string XMLConfigFileName { get; set; }
Public Property XMLConfigFileName As String
	Get
	Set
public:
property String^ XMLConfigFileName {
	String^ get ();
	void set (String^ value);
}
member XMLConfigFileName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 It uses default configuration if it is not set.
See Also
Reference
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace